RT-Thread/rt-thread/bsp/at32/Libraries/AT32_Std_Driver/AT32F4xx_StdPeriph_Driver/src/at32f4xx_flash.c
/**
 **************************************************************************
 * File Name    : at32f4xx_flash.c
 * Description  : at32f4xx FMC source file
 * Date         : 2018-10-08
 * Version      : V1.0.5
 **************************************************************************
 */


/* Includes ------------------------------------------------------------------*/
#include "at32f4xx_flash.h"

/** @addtogroup at32f4xx_StdPeriph_Driver
  * @{
  */

/** @defgroup FLASH
  * @brief FLASH driver modules
  * @{
  */

/** @defgroup FLASH_Private_TypesDefinitions
  * @{
  */

/**
  * @}
  */

/** @defgroup FLASH_Private_Defines
  * @{
  */


/* Flash Control Register bits */
#define CTRL_PRGM_Set               ((uint32_t)0x00000001)
#define CTRL_PRGM_Rst               ((uint32_t)0xFFFFFFFE)
#define CTRL_PGERS_Set              ((uint32_t)0x00000002)
#define CTRL_PGERS_Rst              ((uint32_t)0xFFFFFFFD)
#define CTRL_CHPERS_Set             ((uint32_t)0x00000004)
#define CTRL_CHPERS_Rst             ((uint32_t)0xFFFFFFFB)
#define CTRL_UOBPRGM_Set            ((uint32_t)0x00000010)
#define CTRL_UOBPRGM_Rst            ((uint32_t)0xFFFFFFEF)
#define CTRL_UOBERS_Set             ((uint32_t)0x00000020)
#define CTRL_UOBERS_Rst             ((uint32_t)0xFFFFFFDF)
#define CTRL_STRT_Set               ((uint32_t)0x00000040)
#define CTRL_LCK_Set                ((uint32_t)0x00000080)
#define CTRL_UOBWE_Rst              ((uint32_t)0xFFFFFDFF)

/* FLASH Mask */
#define RDPRT_Mask                  ((uint32_t)0x00000002)
#define WRPRT0_Mask                 ((uint32_t)0x000000FF)
#define WRPRT1_Mask                 ((uint32_t)0x0000FF00)
#define WRPRT2_Mask                 ((uint32_t)0x00FF0000)
#define WRPRT3_Mask                 ((uint32_t)0xFF000000)
#define UOB_USR_BTOPT               ((uint16_t)0x0008)

#define OPTION_BYTE_PRT_Key         ((uint16_t)0x00CC)

/* FLASH Keys */
#define RDPRT_Key                   ((uint16_t)0x00A5)
#define FLASH_KEY1                  ((uint32_t)0x45670123)
#define FLASH_KEY2                  ((uint32_t)0xCDEF89AB)
#define SLIB_UNLOCK_KEY             ((uint32_t)0xA35F6D24)

/* FLASH BANK address */
#if defined(AT32F403Cx_XL) || defined(AT32F403Rx_XL) || defined(AT32F403Vx_XL) || defined(AT32F403Zx_XL) || \
    defined(AT32F403ACGU7) || defined(AT32F403ACGT7) || defined(AT32F403ARGT7) || defined(AT32F403AVGT7) || \
    defined(AT32F407RGT7)  || defined(AT32F407VGT7)
#define FLASH_BNK1_SIZE             ((uint32_t)0x80000)
#define FLASH_BNK1_END_ADDR         ((uint32_t)0x807FFFF)
#else
#define FLASH_BNK1_SIZE             ((*((uint32_t*)0x1FFFF7E0)) * 1024)
#define FLASH_BNK1_END_ADDR         (((uint32_t)0x8000000) + FLASH_BNK1_SIZE - 1)
#endif
#define FLASH_BNK2_END_ADDR         ((uint32_t)0x80FFFFF)
#define FLASH_BNK3_START_ADDR       ((uint32_t)0x8400000)
#if defined (AT32F415xx)
#define FLASH_SYSMEM_START_ADDR     ((uint32_t)0x1FFFAC00)
#define FLASH_SYSMEM_END_ADDR       ((uint32_t)0x1FFFF3FF)
#endif

/* Delay definition */
#define ERS_TIMEOUT                 ((uint32_t)0x10000000)
#define PRGM_TIMEOUT                ((uint32_t)0x0000F000)
#define EXT_FLASH_ERS_TIMEOUT       ((uint32_t)0xFFFFFFFF)
#define EXT_FLASH_PRGM_TIMEOUT      ((uint32_t)0x00080000)
/**
  * @}
  */

/** @defgroup FLASH_Private_Macros
  * @{
  */
#define IS_SYS_BOOTLOADER()       ((FLASH->SLIB_CDR0 & FLASH_SLIB_CDR0_BOOT_DIS) == 0x0)
#define IS_RDP_DISABLE()          (FLASH_GetReadProtectStatus() == RESET)

#define IS_MAIN_SLIB()             ((FLASH->SLIB_CDR0 & FLASH_SLIB_CDR0_SLIB_EN)? 1:0)
#define IS_SYS_SLIB()             ((FLASH->SLIB_CDR0 & FLASH_SLIB_CDR0_SYS_SLIB_EN)? TRUE:FALSE)
#define IS_SLIB_DISABLE()          (IS_MAIN_SLIB()? 0:1)
/**
  * @}
  */

/** @defgroup FLASH_Private_Variables
  * @{
  */

/**
  * @}
  */

/** @defgroup FLASH_Private_FunctionPrototypes
  * @{
  */

/**
  * @}
  */

/** @defgroup FLASH_Private_Functions
  * @{
  */

/**
  * @brief  Unlocks the FLASH Controller.
  * @note   This function can be used for all at32f4xx devices.
  *         - For AT32F4xx XL-Density devices this function unlocks Bank1 and Bank2.
  *         - For all other devices it unlocks Bank1 and it is equivalent
  *           to FLASH_UnlockBank1 function..
  * @param  None
  * @retval None
  */
void FLASH_Unlock(void)
{
  /* Authorize the FC of Bank1 Access */
  FLASH->FCKEY = FLASH_KEY1;
  FLASH->FCKEY = FLASH_KEY2;

#if defined(AT32F403Cx_XL) || defined(AT32F403Rx_XL) || defined(AT32F403Vx_XL) || defined(AT32F403Zx_XL) || \
    defined(AT32F403ACGU7) || defined(AT32F403ACGT7) || defined(AT32F403ARGT7) || defined(AT32F403AVGT7) || \
    defined(AT32F407RGT7)  || defined(AT32F407VGT7)
  /* Authorize the FC of Bank2 Access */
  FLASH->FCKEY2 = FLASH_KEY1;
  FLASH->FCKEY2 = FLASH_KEY2;
#endif
}
/**
  * @brief  Unlocks the FLASH Bank1 Controller.
  * @note   This function can be used for all at32f4xx devices.
  *         - For AT32F4xx XL-Density devices this function unlocks Bank1.
  *         - For all other devices it unlocks Bank1 and it is
  *           equivalent to FLASH_Unlock function.
  * @param  None
  * @retval None
  */
void FLASH_UnlockBank1(void)
{
  /* Authorize the FC of Bank1 Access */
  FLASH->FCKEY = FLASH_KEY1;
  FLASH->FCKEY = FLASH_KEY2;
}

#if defined(AT32F403Cx_XL) || defined(AT32F403Rx_XL) || defined(AT32F403Vx_XL) || defined(AT32F403Zx_XL) || \
    defined(AT32F403ACGU7) || defined(AT32F403ACGT7) || defined(AT32F403ARGT7) || defined(AT32F403AVGT7) || \
    defined(AT32F407RGT7)  || defined(AT32F407VGT7)
/**
  * @brief  Unlocks the FLASH Bank2 Controller.
  * @note   This function can be used only for AT32F4xx XL-Density devices.
  * @param  None
  * @retval None
  */
void FLASH_UnlockBank2(void)
{
  /* Authorize the FC of Bank2 Access */
  FLASH->FCKEY2 = FLASH_KEY1;
  FLASH->FCKEY2 = FLASH_KEY2;

}
#endif

#if !defined (AT32F415xx)
/**
  * @brief  Unlocks the FLASH Bank3 Controller for external flash.
  * @note   This function can not be used for AT32F415 devices.
  * @param  None
  * @retval None
  */
void FLASH_UnlockBank3(void)
{
  /* Authorize the FC of Bank3 Access */
  FLASH->FCKEY3 = FLASH_KEY1;
  FLASH->FCKEY3 = FLASH_KEY2;
}
#endif

/**
  * @brief  Locks the FLASH Controller.
  * @note   This function can be used for all at32f4xx devices.
  *         - For AT32F4xx XL-Density devices this function Locks Bank1 and Bank2.
  *         - For all other devices it Locks Bank1 and it is equivalent
  *           to FLASH_LockBank1 function.
  * @param  None
  * @retval None
  */
void FLASH_Lock(void)
{
  /* Set the Lock Bit to lock the FC and the CTRL of  Bank1 */
  FLASH->CTRL |= CTRL_LCK_Set;

#if defined(AT32F403Cx_XL) || defined(AT32F403Rx_XL) || defined(AT32F403Vx_XL) || defined(AT32F403Zx_XL) || \
    defined(AT32F403ACGU7) || defined(AT32F403ACGT7) || defined(AT32F403ARGT7) || defined(AT32F403AVGT7) || \
    defined(AT32F407RGT7)  || defined(AT32F407VGT7)
  /* Set the Lock Bit to lock the FC and the CTRL of  Bank2 */
  FLASH->CTRL2 |= CTRL_LCK_Set;
#endif
}

/**
  * @brief  Locks the FLASH Bank1 Controller.
  * @note   this function can be used for all at32f4xx devices.
  *         - For AT32F4xx XL-Density devices this function Locks Bank1.
  *         - For all other devices it Locks Bank1 and it is equivalent
  *           to FLASH_Lock function.
  * @param  None
  * @retval None
  */
void FLASH_LockBank1(void)
{
  /* Set the Lock Bit to lock the FC and the CTRL of  Bank1 */
  FLASH->CTRL |= CTRL_LCK_Set;
}

#if defined(AT32F403Cx_XL) || defined(AT32F403Rx_XL) || defined(AT32F403Vx_XL) || defined(AT32F403Zx_XL) || \
    defined(AT32F403ACGU7) || defined(AT32F403ACGT7) || defined(AT32F403ARGT7) || defined(AT32F403AVGT7) || \
    defined(AT32F407RGT7)  || defined(AT32F407VGT7)
/**
  * @brief  Locks the FLASH Bank2 Controller.
  * @note   This function can be used only for AT32F4xx XL-Density devices.
  * @param  None
  * @retval None
  */
void FLASH_LockBank2(void)
{
  /* Set the Lock Bit to lock the FC and the CTRL of  Bank2 */
  FLASH->CTRL2 |= CTRL_LCK_Set;
}
#endif

#if !defined (AT32F415xx)
/**
  * @brief  Locks the FLASH Bank3 Controller for external flash.
  * @note   This function can not be used for AT32F415 devices.
  * @param  None
  * @retval None
  */
void FLASH_LockBank3(void)
{
  /* Set the Lock Bit to lock the FC and the CTRL of  Bank3 */
  FLASH->CTRL3 |= CTRL_LCK_Set;
}
#endif

/**
  * @brief  Erases a specified FLASH page.
  * @note   This function can be used for all at32f4xx devices.
  * @param  Page_Address: The page address to be erased.
  * @retval FLASH Status: The returned value can be: FLASH_BSY, FLASH_PGRM_FLR,
  *         FLASH_WRPRT_FLR, FLASH_PRC_DONE or FLASH_TIMEOUT.
  */
FLASH_Status FLASH_ErasePage(uint32_t Page_Address)
{
  FLASH_Status status = FLASH_PRC_DONE;
  /* Check the parameters */
  assert_param(IS_FLASH_ADDR(Page_Address));

#if !defined (AT32F415xx)
  /* BANK3 : External flash */
  if(Page_Address >= FLASH_BNK3_START_ADDR)
  {
    /* Wait for last process to be completed */
    status = FLASH_WaitForBank3Process(EXT_FLASH_ERS_TIMEOUT);

    if(status == FLASH_PRC_DONE)
    {
      /* if the previous process is completed, continue to erase the page */
      FLASH->CTRL3 |= CTRL_PGERS_Set;
      FLASH->ADDR3 = Page_Address;
      FLASH->CTRL3 |= CTRL_STRT_Set;

