RT-Thread/rt-thread/bsp/at32/Libraries/AT32_Std_Driver/AT32F4xx_StdPeriph_Driver/src/at32f4xx_flash.c
      /* Wait for last process to be completed */
      status = FLASH_WaitForBank3Process(EXT_FLASH_ERS_TIMEOUT);

      /* Disable the PGERS Bit */
      FLASH->CTRL3 &= CTRL_PGERS_Rst;
    }

    return status;
  }
#endif
#if defined (AT32F415xx)
  if(Page_Address >= FLASH_SYSMEM_START_ADDR && Page_Address <= FLASH_SYSMEM_END_ADDR)
  {
    /* Wait for last process to be completed */
    status = FLASH_WaitForProcess(ERS_TIMEOUT);

    if(status == FLASH_PRC_DONE)
    {
      /* if the previous process is completed, continue to erase the page */
      FLASH->CTRL |= CTRL_PGERS_Set;
      FLASH->ADDR = Page_Address;
      FLASH->CTRL |= CTRL_STRT_Set;

      /* Wait for last process to be completed */
      status = FLASH_WaitForProcess(ERS_TIMEOUT);

      /* Disable the PGERS Bit */
      FLASH->CTRL &= CTRL_PGERS_Rst;
    }
  }
#endif

  if(Page_Address <= FLASH_BNK1_END_ADDR)
  {
    /* Wait for last process to be completed */
    status = FLASH_WaitForBank1Process(ERS_TIMEOUT);

    if(status == FLASH_PRC_DONE)
    {
      /* if the previous process is completed, continue to erase the page */
      FLASH->CTRL |= CTRL_PGERS_Set;
      FLASH->ADDR = Page_Address;
      FLASH->CTRL |= CTRL_STRT_Set;

      /* Wait for last process to be completed */
      status = FLASH_WaitForBank1Process(ERS_TIMEOUT);

      /* Disable the PGERS Bit */
      FLASH->CTRL &= CTRL_PGERS_Rst;
    }
  }
#if defined(AT32F403Cx_XL) || defined(AT32F403Rx_XL) || defined(AT32F403Vx_XL) || defined(AT32F403Zx_XL) || \
    defined(AT32F403ACGU7) || defined(AT32F403ACGT7) || defined(AT32F403ARGT7) || defined(AT32F403AVGT7) || \
    defined(AT32F407RGT7)  || defined(AT32F407VGT7)
  else if((Page_Address > FLASH_BNK1_END_ADDR)&&(Page_Address <= FLASH_BNK2_END_ADDR))
  {
    /* Wait for last process to be completed */
    status = FLASH_WaitForBank2Process(ERS_TIMEOUT);

    if(status == FLASH_PRC_DONE)
    {
      /* if the previous process is completed, continue to erase the page */
      FLASH->CTRL2 |= CTRL_PGERS_Set;
      FLASH->ADDR2 = Page_Address;
      FLASH->CTRL2 |= CTRL_STRT_Set;

      /* Wait for last process to be completed */
      status = FLASH_WaitForBank2Process(ERS_TIMEOUT);

      /* Disable the PGERS Bit */
      FLASH->CTRL2 &= CTRL_PGERS_Rst;
    }
  }
#endif

  /* Return the Erase Status */
  return status;
}

/**
  * @brief  Erases all internal FLASH pages.
  * @note   This function can be used for all at32f4xx devices.
  *         This function will not erase external flash pages.
  * @param  None
  * @retval FLASH Status: The returned value can be: FLASH_PGRM_FLR,
  *         FLASH_WRPRT_FLR, FLASH_PRC_DONE or FLASH_TIMEOUT.
  */
FLASH_Status FLASH_EraseAllPages(void)
{
  FLASH_Status status = FLASH_PRC_DONE;

#if defined(AT32F403Cx_XL) || defined(AT32F403Rx_XL) || defined(AT32F403Vx_XL) || defined(AT32F403Zx_XL) || \
    defined(AT32F403ACGU7) || defined(AT32F403ACGT7) || defined(AT32F403ARGT7) || defined(AT32F403AVGT7) || \
    defined(AT32F407RGT7)  || defined(AT32F407VGT7)
  /* Wait for last process to be completed */
  status = FLASH_WaitForBank1Process(ERS_TIMEOUT);

  if(status == FLASH_PRC_DONE)
  {
    /* if the previous process is completed, continue to erase all pages */
    FLASH->CTRL |= CTRL_CHPERS_Set;
    FLASH->CTRL |= CTRL_STRT_Set;

    /* Wait for last process to be completed */
    status = FLASH_WaitForBank1Process(ERS_TIMEOUT);

    /* Disable the CHPERS Bit */
    FLASH->CTRL &= CTRL_CHPERS_Rst;
  }

  if(status == FLASH_PRC_DONE)
  {
    /* if the previous process is completed, continue to erase all pages */
    FLASH->CTRL2 |= CTRL_CHPERS_Set;
    FLASH->CTRL2 |= CTRL_STRT_Set;

    /* Wait for last process to be completed */
    status = FLASH_WaitForBank2Process(ERS_TIMEOUT);

    /* Disable the CHPERS Bit */
    FLASH->CTRL2 &= CTRL_CHPERS_Rst;
  }

#else
  /* Wait for last process to be completed */
  status = FLASH_WaitForProcess(ERS_TIMEOUT);

  if(status == FLASH_PRC_DONE)
  {
    /* if the previous process is completed, continue to erase all pages */
    FLASH->CTRL |= CTRL_CHPERS_Set;
    FLASH->CTRL |= CTRL_STRT_Set;

    /* Wait for last process to be completed */
    status = FLASH_WaitForProcess(ERS_TIMEOUT);

    /* Disable the CHPERS Bit */
    FLASH->CTRL &= CTRL_CHPERS_Rst;
  }

#endif

  /* Return the Erase Status */
  return status;
}

/**
  * @brief  Erases all Bank1 FLASH pages.
  * @note   This function can be used for all at32f4xx devices.
  *         - For AT32F4xx XL-Density devices this function erases all Bank1 pages.
  *         - For all other devices it erases all Bank1 pages and it is equivalent
  *           to FLASH_EraseAllPages function.
  * @param  None
  * @retval FLASH Status: The returned value can be: FLASH_PGRM_FLR,
  *         FLASH_WRPRT_FLR, FLASH_PRC_DONE or FLASH_TIMEOUT.
  */
FLASH_Status FLASH_EraseBank1AllPages(void)
{
  FLASH_Status status = FLASH_PRC_DONE;
  /* Wait for last process to be completed */
  status = FLASH_WaitForBank1Process(ERS_TIMEOUT);

  if(status == FLASH_PRC_DONE)
  {
    /* if the previous process is completed, continue to erase all pages */
    FLASH->CTRL |= CTRL_CHPERS_Set;
    FLASH->CTRL |= CTRL_STRT_Set;

    /* Wait for last process to be completed */
    status = FLASH_WaitForBank1Process(ERS_TIMEOUT);

    /* Disable the CHPERS Bit */
    FLASH->CTRL &= CTRL_CHPERS_Rst;
  }

  /* Return the Erase Status */
  return status;
}

#if defined(AT32F403Cx_XL) || defined(AT32F403Rx_XL) || defined(AT32F403Vx_XL) || defined(AT32F403Zx_XL) || \
    defined(AT32F403ACGU7) || defined(AT32F403ACGT7) || defined(AT32F403ARGT7) || defined(AT32F403AVGT7) || \
    defined(AT32F407RGT7)  || defined(AT32F407VGT7)
/**
  * @brief  Erases all Bank2 FLASH pages.
  * @note   This function can be used only for at32f4xx XL-Density devices.
  * @param  None
  * @retval FLASH Status: The returned value can be: FLASH_PGRM_FLR,
  *         FLASH_WRPRT_FLR, FLASH_PRC_DONE or FLASH_TIMEOUT.
  */
FLASH_Status FLASH_EraseBank2AllPages(void)
{
  FLASH_Status status = FLASH_PRC_DONE;
  /* Wait for last process to be completed */
  status = FLASH_WaitForBank2Process(ERS_TIMEOUT);

  if(status == FLASH_PRC_DONE)
  {
    /* if the previous process is completed, continue to erase all pages */
    FLASH->CTRL2 |= CTRL_CHPERS_Set;
    FLASH->CTRL2 |= CTRL_STRT_Set;

