RT-Thread/rt-thread/bsp/at32/Libraries/AT32_Std_Driver/AT32F4xx_StdPeriph_Driver/src/at32f4xx_flash.c
    /* Wait for last process to be completed */
    status = FLASH_WaitForBank2Process(ERS_TIMEOUT);

    /* Disable the CHPERS Bit */
    FLASH->CTRL2 &= CTRL_CHPERS_Rst;
  }

  /* Return the Erase Status */
  return status;
}
#endif

#if !defined (AT32F415xx)
/**
  * @brief  Erases all Bank3 FLASH pages.
  * @note   This function can not be used for AT32F415 devices.
  * @param  None
  * @retval FLASH Status: The returned value can be: FLASH_PGRM_FLR,
  *         FLASH_WRPRT_FLR, FLASH_PRC_DONE or FLASH_TIMEOUT.
  */
FLASH_Status FLASH_EraseBank3AllPages(void)
{
  FLASH_Status status = FLASH_PRC_DONE;
  if(FLASH_GetSlibState())
    return FLASH_PGRM_FLR;
  /* Wait for last process to be completed */
  status = FLASH_WaitForBank3Process(EXT_FLASH_ERS_TIMEOUT);

  if(status == FLASH_PRC_DONE)
  {
    /* if the previous process is completed, continue to erase all pages */
    FLASH->CTRL3 |= CTRL_CHPERS_Set;
    FLASH->CTRL3 |= CTRL_STRT_Set;

    /* Wait for last process to be completed */
    status = FLASH_WaitForBank3Process(EXT_FLASH_ERS_TIMEOUT);

    /* Disable the CHPERS Bit */
    FLASH->CTRL3 &= CTRL_CHPERS_Rst;
  }

  /* Return the Erase Status */
  return status;
}
#endif

/**
  * @brief  Erases the FLASH option bytes.
  * @note   This functions erases all option bytes except the Read protection (RDP).
  * @note   This function can be used for all at32f4xx devices.
  * @param  None
  * @retval FLASH Status: The returned value can be: FLASH_PGRM_FLR,
  *         FLASH_WRPRT_FLR, FLASH_PRC_DONE or FLASH_TIMEOUT.
  */
FLASH_Status FLASH_EraseUserOptionBytes(void)
{
  uint16_t rdptmp = RDPRT_Key;

  FLASH_Status status = FLASH_PRC_DONE;

  /* Get the actual read protection Option Byte value */
  if(FLASH_GetReadProtectStatus() != RESET)
  {
    rdptmp = 0x00;
  }

  /* Wait for last process to be completed */
  status = FLASH_WaitForProcess(ERS_TIMEOUT);

  if(status == FLASH_PRC_DONE)
  {
    /* Authorize the small information block programming */
    FLASH->OPTKEYR = FLASH_KEY1;
    FLASH->OPTKEYR = FLASH_KEY2;

    /* if the previous process is completed, continue to erase the option bytes */
    FLASH->CTRL |= CTRL_UOBERS_Set;
    FLASH->CTRL |= CTRL_STRT_Set;
    /* Wait for last process to be completed */
    status = FLASH_WaitForProcess(ERS_TIMEOUT);

    if(status == FLASH_PRC_DONE)
    {
      /* if the erase process is completed, disable the UOBERS Bit */
      FLASH->CTRL &= CTRL_UOBERS_Rst;

      /* Enable the Option Bytes Programming process */
      FLASH->CTRL |= CTRL_UOBPRGM_Set;
      /* Restore the last read protection Option Byte value */
      UOPTB->RDPRT = (uint16_t)rdptmp;
      /* Wait for last process to be completed */
      status = FLASH_WaitForProcess(PRGM_TIMEOUT);

      if(status != FLASH_TIMEOUT)
      {
        /* if the program process is completed, disable the UOBPRGM Bit */
        FLASH->CTRL &= CTRL_UOBPRGM_Rst;
      }
    }
    else
    {
      if (status != FLASH_TIMEOUT)
      {
        /* Disable the UOBPRGM Bit */
        FLASH->CTRL &= CTRL_UOBPRGM_Rst;
      }
    }
  }

  /* Return the erase status */
  return status;
}

/**
  * @brief  Programs a word at a specified address.
  * @note   This function can be used for all at32f4xx devices.
  * @param  Address: specifies the address to be programmed.
  * @param  Data: specifies the data to be programmed.
  * @retval FLASH Status: The returned value can be: FLASH_PGRM_FLR,
  *         FLASH_WRPRT_FLR, FLASH_PRC_DONE or FLASH_TIMEOUT.
  */
FLASH_Status FLASH_ProgramWord(uint32_t Address, uint32_t Data)
{
  FLASH_Status status = FLASH_PRC_DONE;
  __IO uint32_t tmp = 0;

  /* Check the parameters */
  assert_param(IS_FLASH_ADDR(Address));

#if !defined (AT32F415xx)
  if (Address >= FLASH_BNK3_START_ADDR)
  {
    /* Wait for last process to be completed */
    status = FLASH_WaitForBank3Process(PRGM_TIMEOUT);

    if(status == FLASH_PRC_DONE)
    {
      FLASH->CTRL3 |= CTRL_PRGM_Set;

      *(__IO uint32_t*) Address = Data;

      /* Wait for last process to be completed */
      status = FLASH_WaitForBank3Process(PRGM_TIMEOUT);

      /* Disable the PRGM Bit */
      FLASH->CTRL3 &= CTRL_PRGM_Rst;
    }

    return status;
  }
#endif
#if defined (AT32F415xx)
  if(Address >= FLASH_SYSMEM_START_ADDR && Address <= FLASH_SYSMEM_END_ADDR)
  {
    status = FLASH_WaitForProcess(PRGM_TIMEOUT);
    if(status == FLASH_PRC_DONE)
    {
      /* if the previous process is completed, continue to program the new data */
      FLASH->CTRL |= CTRL_PRGM_Set;

      *(__IO uint32_t*)Address = Data;
      /* Wait for last process to be completed */
      status = FLASH_WaitForProcess(PRGM_TIMEOUT);

      /* Disable the PRGM Bit */
      FLASH->CTRL &= CTRL_PRGM_Rst;
    }
  }
#endif

  if(Address <= FLASH_BNK1_END_ADDR)
  {
    /* Wait for last process to be completed */
    status = FLASH_WaitForBank1Process(PRGM_TIMEOUT);

    if(status == FLASH_PRC_DONE)
    {
      FLASH->CTRL |= CTRL_PRGM_Set;

      *(__IO uint32_t*) Address = Data;

      /* Wait for last process to be completed */
      status = FLASH_WaitForProcess(PRGM_TIMEOUT);

      /* Disable the PRGM Bit */
      FLASH->CTRL &= CTRL_PRGM_Rst;
    }
  }
#if defined(AT32F403Cx_XL) || defined(AT32F403Rx_XL) || defined(AT32F403Vx_XL) || defined(AT32F403Zx_XL) || \
    defined(AT32F403ACGU7) || defined(AT32F403ACGT7) || defined(AT32F403ARGT7) || defined(AT32F403AVGT7) || \
    defined(AT32F407RGT7)  || defined(AT32F407VGT7)
  else if((Address > FLASH_BNK1_END_ADDR)&&(Address <= FLASH_BNK2_END_ADDR))
  {
    /* Wait for last process to be completed */
    status = FLASH_WaitForBank2Process(PRGM_TIMEOUT);

    if(status == FLASH_PRC_DONE)
    {
      FLASH->CTRL2 |= CTRL_PRGM_Set;

      *(__IO uint32_t*) Address = Data;

      /* Wait for last process to be completed */
      status = FLASH_WaitForBank2Process(PRGM_TIMEOUT);

      /* Disable the PRGM Bit */
      FLASH->CTRL2 &= CTRL_PRGM_Rst;
    }
  }
#endif

  /* Return the Program Status */
  return status;
}

/**
  * @brief  Programs a half word at a specified address.
  * @note   This function can be used for all at32f4xx devices.
  * @param  Address: specifies the address to be programmed.
  * @param  Data: specifies the data to be programmed.
  * @retval FLASH Status: The returned value can be: FLASH_PGRM_FLR,
  *         FLASH_WRPRT_FLR, FLASH_PRC_DONE or FLASH_TIMEOUT.
  */
FLASH_Status FLASH_ProgramHalfWord(uint32_t Address, uint16_t Data)
{
  FLASH_Status status = FLASH_PRC_DONE;
  /* Check the parameters */
  assert_param(IS_FLASH_ADDR(Address));

#if !defined (AT32F415xx)
  if (Address >= FLASH_BNK3_START_ADDR)
  {
    /* Wait for last process to be completed */
    status = FLASH_WaitForBank3Process(PRGM_TIMEOUT);

    if(status == FLASH_PRC_DONE)
    {
      /* if the previous process is completed, continue to program the new data */
      FLASH->CTRL3 |= CTRL_PRGM_Set;

      *(__IO uint16_t*)Address = Data;
      /* Wait for last process to be completed */
      status = FLASH_WaitForBank3Process(PRGM_TIMEOUT);

