RT-Thread/rt-thread/bsp/at32/Libraries/AT32_Std_Driver/AT32F4xx_StdPeriph_Driver/src/at32f4xx_flash.c
      /* Disable the PRGM Bit */
      FLASH->CTRL3 &= CTRL_PRGM_Rst;
    }
    return status;
  }
#endif
#if defined (AT32F415xx)
  if(Address >= FLASH_SYSMEM_START_ADDR && Address <= FLASH_SYSMEM_END_ADDR)
  {
    status = FLASH_WaitForProcess(PRGM_TIMEOUT);
    if(status == FLASH_PRC_DONE)
    {
      /* if the previous process is completed, continue to program the new data */
      FLASH->CTRL |= CTRL_PRGM_Set;

      *(__IO uint16_t*)Address = Data;
      /* Wait for last process to be completed */
      status = FLASH_WaitForProcess(PRGM_TIMEOUT);

      /* Disable the PRGM Bit */
      FLASH->CTRL &= CTRL_PRGM_Rst;
    }
  }
#endif

  /* Wait for last process to be completed */
  if(Address <= FLASH_BNK1_END_ADDR)
  {
    status = FLASH_WaitForBank1Process(PRGM_TIMEOUT);
    if(status == FLASH_PRC_DONE)
    {
      /* if the previous process is completed, continue to program the new data */
      FLASH->CTRL |= CTRL_PRGM_Set;

      *(__IO uint16_t*)Address = Data;
      /* Wait for last process to be completed */
      status = FLASH_WaitForBank1Process(PRGM_TIMEOUT);

      /* Disable the PRGM Bit */
      FLASH->CTRL &= CTRL_PRGM_Rst;
    }
  }
#if defined(AT32F403Cx_XL) || defined(AT32F403Rx_XL) || defined(AT32F403Vx_XL) || defined(AT32F403Zx_XL) || \
    defined(AT32F403ACGU7) || defined(AT32F403ACGT7) || defined(AT32F403ARGT7) || defined(AT32F403AVGT7) || \
    defined(AT32F407RGT7)  || defined(AT32F407VGT7)
  else if((Address > FLASH_BNK1_END_ADDR)&&(Address <= FLASH_BNK2_END_ADDR))
  {
    status = FLASH_WaitForBank2Process(PRGM_TIMEOUT);
    if(status == FLASH_PRC_DONE)
    {
      /* if the previous process is completed, continue to program the new data */
      FLASH->CTRL2 |= CTRL_PRGM_Set;

      *(__IO uint16_t*)Address = Data;
      /* Wait for last process to be completed */
      status = FLASH_WaitForBank2Process(PRGM_TIMEOUT);

      /* Disable the PRGM Bit */
      FLASH->CTRL2 &= CTRL_PRGM_Rst;
    }
  }
#endif

  /* Return the Program Status */
  return status;
}

/**
  * @brief  Programs a byte at a specified address.
  * @note   This function can be used for all at32f4xx devices.
            This function cannot be used to program bank3.
  * @param  Address: specifies the address to be programmed.
  * @param  Data: specifies the data to be programmed.
  * @retval FLASH Status: The returned value can be: FLASH_PGRM_FLR,
  *         FLASH_WRPRT_FLR, FLASH_PRC_DONE or FLASH_TIMEOUT.
  */
FLASH_Status FLASH_ProgramByte(uint32_t Address, uint8_t Data)
{
  FLASH_Status status = FLASH_PRC_DONE;
  /* Check the parameters */
  assert_param(IS_FLASH_ADDR(Address));

#if !defined (AT32F415xx)
  if (Address >= FLASH_BNK3_START_ADDR)
  {
    /* This function cannot be used to program bank3 */
    return FLASH_WRPRT_FLR;
  }
#endif
#if defined (AT32F415xx)
  if(Address >= FLASH_SYSMEM_START_ADDR && Address <= FLASH_SYSMEM_END_ADDR)
  {
    status = FLASH_WaitForProcess(PRGM_TIMEOUT);
    if(status == FLASH_PRC_DONE)
    {
      /* if the previous process is completed, continue to program the new data */
      FLASH->CTRL |= CTRL_PRGM_Set;

      *(__IO uint8_t*)Address = Data;
      /* Wait for last process to be completed */
      status = FLASH_WaitForProcess(PRGM_TIMEOUT);

      /* Disable the PRGM Bit */
      FLASH->CTRL &= CTRL_PRGM_Rst;
    }
  }
#endif

  if(Address <= FLASH_BNK1_END_ADDR)
  {
    status = FLASH_WaitForBank1Process(PRGM_TIMEOUT);
    if(status == FLASH_PRC_DONE)
    {
      /* if the previous process is completed, continue to program the new data */
      FLASH->CTRL |= CTRL_PRGM_Set;

      *(__IO uint8_t*)Address = Data;
      /* Wait for last process to be completed */
      status = FLASH_WaitForBank1Process(PRGM_TIMEOUT);

      /* Disable the PRGM Bit */
      FLASH->CTRL &= CTRL_PRGM_Rst;
    }
  }
#if defined(AT32F403Cx_XL) || defined(AT32F403Rx_XL) || defined(AT32F403Vx_XL) || defined(AT32F403Zx_XL) || \
    defined(AT32F403ACGU7) || defined(AT32F403ACGT7) || defined(AT32F403ARGT7) || defined(AT32F403AVGT7) || \
    defined(AT32F407RGT7)  || defined(AT32F407VGT7)
  else if((Address > FLASH_BNK1_END_ADDR)&&(Address <= FLASH_BNK2_END_ADDR))
  {
    status = FLASH_WaitForBank2Process(PRGM_TIMEOUT);
    if(status == FLASH_PRC_DONE)
    {
      /* if the previous process is completed, continue to program the new data */
      FLASH->CTRL2 |= CTRL_PRGM_Set;

      *(__IO uint8_t*)Address = Data;
      /* Wait for last process to be completed */
      status = FLASH_WaitForBank2Process(PRGM_TIMEOUT);

      /* Disable the PRGM Bit */
      FLASH->CTRL2 &= CTRL_PRGM_Rst;
    }
  }
#endif
  /* Return the Program Status */
  return status;
}

/**
  * @brief  Programs a half word at a specified Option Byte Data address.
  * @note   This function can be used for all at32f4xx devices.
  * @param  Address: specifies the address to be programmed.
  * @param  Data: specifies the data to be programmed.
  * @retval FLASH Status: The returned value can be: FLASH_PGRM_FLR,
  *         FLASH_WRPRT_FLR, FLASH_PRC_DONE or FLASH_TIMEOUT.
  */
FLASH_Status FLASH_ProgramUserOptionByteData(uint32_t Address, uint8_t Data)
{
  FLASH_Status status = FLASH_PRC_DONE;
  status = FLASH_WaitForProcess(PRGM_TIMEOUT);

  if(status == FLASH_PRC_DONE)
  {
    /* Authorize the small information block programming */
    FLASH->OPTKEYR = FLASH_KEY1;
    FLASH->OPTKEYR = FLASH_KEY2;
    /* Enables the Option Bytes Programming process */
    FLASH->CTRL |= CTRL_UOBPRGM_Set;
    *(__IO uint16_t*)Address = Data;

    /* Wait for last process to be completed */
    status = FLASH_WaitForProcess(PRGM_TIMEOUT);

    if(status != FLASH_TIMEOUT)
    {
      /* if the program process is completed, disable the UOBPRGM Bit */
      FLASH->CTRL &= CTRL_UOBPRGM_Rst;
    }
  }

  /* Return the Option Byte Data Program Status */
  return status;
}

/**
  * @brief  Write protects the desired pages
  * @note   This function can be used for all at32f4xx devices.
  * @param  FLASH_Pages: specifies the address of the pages to be write protected.
  *   This parameter can be:
  *     @arg For @b AT32F415xx devices: value between FLASH_WRPRT_PAGE_0to1 and
  *       FLASH_WRPRT_PAGE_60to61 or FLASH_WRPRT_PAGE_62to63 or FLASH_WRPRT_PAGE_62to127
  *     @arg For @b AT32F4xx Medium-density_devices: value between FLASH_WRPRT_PAGE_0to3 and
  *       FLASH_WRPRT_PAGE_60to63 or FLASH_WRPRT_PAGE_124to127
  *     @arg For @b AT32F4xx High-density_devices: value between FLASH_WRPRT_PAGE_0to1 and
  *       FLASH_WRPRT_PAGE_60to61 or FLASH_WRPRT_PAGE_62to127 or FLASH_WRPRT_PAGE_62to255
  *     @arg For @b AT32F4xx XL-density_devices: value between FLASH_WRPRT_PAGE_0to1 and
  *       FLASH_WRPRT_PAGE_60to61 or FLASH_WRPRT_PAGE_62to511
  *     @arg FLASH_WRPRT_AllPAGES
  * @retval FLASH Status: The returned value can be: FLASH_PGRM_FLR,
  *         FLASH_WRPRT_FLR, FLASH_PRC_DONE or FLASH_TIMEOUT.
  */
FLASH_Status FLASH_EnableWriteProtect(uint32_t FLASH_Pages)
{
  uint16_t WRP0_Data = 0xFFFF, WRP1_Data = 0xFFFF, WRP2_Data = 0xFFFF, WRP3_Data = 0xFFFF;

  FLASH_Status status = FLASH_PRC_DONE;

  /* Check the parameters */
  assert_param(IS_FLASH_WRPRT_PAGES(FLASH_Pages));

  FLASH_Pages = (uint32_t)(~FLASH_Pages);
  WRP0_Data = (uint16_t)(FLASH_Pages & WRPRT0_Mask);
  WRP1_Data = (uint16_t)((FLASH_Pages & WRPRT1_Mask) >> 8);
  WRP2_Data = (uint16_t)((FLASH_Pages & WRPRT2_Mask) >> 16);
  WRP3_Data = (uint16_t)((FLASH_Pages & WRPRT3_Mask) >> 24);

