RT-Thread/rt-thread/bsp/at32/Libraries/AT32_Std_Driver/AT32F4xx_StdPeriph_Driver/src/at32f4xx_flash.c
  /* Wait for last process to be completed */
  status = FLASH_WaitForProcess(PRGM_TIMEOUT);

  if(status == FLASH_PRC_DONE)
  {
    /* Authorizes the small information block programming */
    FLASH->OPTKEYR = FLASH_KEY1;
    FLASH->OPTKEYR = FLASH_KEY2;
    FLASH->CTRL |= CTRL_UOBPRGM_Set;

    if(WRP0_Data != 0xFF)
    {
      UOPTB->WRPRT0 = WRP0_Data;

      /* Wait for last process to be completed */
      status = FLASH_WaitForProcess(PRGM_TIMEOUT);
    }

    if((status == FLASH_PRC_DONE) && (WRP1_Data != 0xFF))
    {
      UOPTB->WRPRT1 = WRP1_Data;

      /* Wait for last process to be completed */
      status = FLASH_WaitForProcess(PRGM_TIMEOUT);
    }

    if((status == FLASH_PRC_DONE) && (WRP2_Data != 0xFF))
    {
      UOPTB->WRPRT2 = WRP2_Data;

      /* Wait for last process to be completed */
      status = FLASH_WaitForProcess(PRGM_TIMEOUT);
    }

    if((status == FLASH_PRC_DONE) && (WRP3_Data != 0xFF))
    {
      UOPTB->WRPRT3 = WRP3_Data;

      /* Wait for last process to be completed */
      status = FLASH_WaitForProcess(PRGM_TIMEOUT);
    }

    if(status != FLASH_TIMEOUT)
    {
      /* if the program process is completed, disable the UOBPRGM Bit */
      FLASH->CTRL &= CTRL_UOBPRGM_Rst;
    }
  }

  /* Return the write protection process Status */
  return status;
}

/**
  * @brief  Enables or disables the read out protection.
  * @note   If the user has already programmed the other option bytes before calling
  *   this function, he must re-program them since this function erases all option bytes.
  * @note   This function can be used for all at32f4xx devices.
  * @param  Newstate: new state of the ReadOut Protection.
  *   This parameter can be: ENABLE or DISABLE.
  * @retval FLASH Status: The returned value can be: FLASH_PGRM_FLR,
  *         FLASH_WRPRT_FLR, FLASH_PRC_DONE or FLASH_TIMEOUT.
  */
FLASH_Status FLASH_ReadProtectConfig(FunctionalState NewState)
{
  FLASH_Status status = FLASH_PRC_DONE;
  /* Check the parameters */
  assert_param(IS_FUNCTIONAL_STATE(NewState));
  status = FLASH_WaitForProcess(ERS_TIMEOUT);

  if(status == FLASH_PRC_DONE)
  {
    /* Authorizes the small information block programming */
    FLASH->OPTKEYR = FLASH_KEY1;
    FLASH->OPTKEYR = FLASH_KEY2;
    FLASH->CTRL |= CTRL_UOBERS_Set;
    FLASH->CTRL |= CTRL_STRT_Set;
    /* Wait for last process to be completed */
    status = FLASH_WaitForProcess(ERS_TIMEOUT);

    if(status == FLASH_PRC_DONE)
    {
      /* if the erase process is completed, disable the UOBERS Bit */
      FLASH->CTRL &= CTRL_UOBERS_Rst;
      /* Enable the Option Bytes Programming process */
      FLASH->CTRL |= CTRL_UOBPRGM_Set;

      if(NewState != DISABLE)
      {
        UOPTB->RDPRT = 0x00;
      }
      else
      {
        UOPTB->RDPRT = RDPRT_Key;
      }

      /* Wait for last process to be completed */
      status = FLASH_WaitForProcess(ERS_TIMEOUT);

      if(status != FLASH_TIMEOUT)
      {
        /* if the program process is completed, disable the UOBPRGM Bit */
        FLASH->CTRL &= CTRL_UOBPRGM_Rst;
      }
    }
    else
    {
      if(status != FLASH_TIMEOUT)
      {
        /* Disable the UOBERS Bit */
        FLASH->CTRL &= CTRL_UOBERS_Rst;
      }
    }
  }

  /* Return the protection process Status */
  return status;
}

/**
  * @brief  Programs the FLASH User Option Byte: IWDG_SW / RST_STOP / RST_STDBY.
  * @note   This function can be used for all at32f4xx devices.
  * @param  UOB_IWDG: Selects the IWDG mode
  *   This parameter can be one of the following values:
  *     @arg UOB_SW_IWDG: Software IWDG selected
  *     @arg UOB_HW_IWDG: Hardware IWDG selected
  * @param  UOB_STOP: Reset event when entering STOP mode.
  *   This parameter can be one of the following values:
  *     @arg UOB_NO_RST_STP: No reset generated when entering in STOP
  *     @arg UOB_RST_STP: Reset generated when entering in STOP
  * @param  UOB_STDBY: Reset event when entering Standby mode.
  *   This parameter can be one of the following values:
  *     @arg UOB_NO_RST_STDBY: No reset generated when entering in STANDBY
  *     @arg UOB_RST_STDBY: Reset generated when entering in STANDBY
  * @retval FLASH Status: The returned value can be: FLASH_PGRM_FLR,
  *         FLASH_WRPRT_FLR, FLASH_PRC_DONE or FLASH_TIMEOUT.
  */
FLASH_Status FLASH_UserOptionByteConfig(uint16_t UOB_IWDG, uint16_t UOB_STOP, uint16_t UOB_STDBY)
{
  FLASH_Status status = FLASH_PRC_DONE;

  /* Check the parameters */
  assert_param(IS_UOB_IWDG_CFG(UOB_IWDG));
  assert_param(IS_UOB_STOP_CFG(UOB_STOP));
  assert_param(IS_UOB_STDBY_CFG(UOB_STDBY));

  /* Authorize the small information block programming */
  FLASH->OPTKEYR = FLASH_KEY1;
  FLASH->OPTKEYR = FLASH_KEY2;

  /* Wait for last process to be completed */
  status = FLASH_WaitForProcess(PRGM_TIMEOUT);

  if(status == FLASH_PRC_DONE)
  {
    /* Enable the Option Bytes Programming process */
    FLASH->CTRL |= CTRL_UOBPRGM_Set;

    UOPTB->USR = UOB_IWDG | (uint16_t)(UOB_STOP | (uint16_t)(UOB_STDBY | ((uint16_t)0xF8)));

    /* Wait for last process to be completed */
    status = FLASH_WaitForProcess(PRGM_TIMEOUT);

    if(status != FLASH_TIMEOUT)
    {
      /* if the program process is completed, disable the UOBPRGM Bit */
      FLASH->CTRL &= CTRL_UOBPRGM_Rst;
    }
  }

  /* Return the Option Byte program Status */
  return status;
}

#if defined(AT32F403Cx_XL) || defined(AT32F403Rx_XL) || defined(AT32F403Vx_XL) || defined(AT32F403Zx_XL) || \
    defined(AT32F403ACGU7) || defined(AT32F403ACGT7) || defined(AT32F403ARGT7) || defined(AT32F403AVGT7) || \
    defined(AT32F407RGT7)  || defined(AT32F407VGT7)
/**
  * @brief  Configures to boot from Bank1 or Bank2.
  * @note   This function can be used only for at32f403_XL density devices.
  * @param  FLASH_BOOT: select the FLASH Bank to boot from.
  *   This parameter can be one of the following values:
  *     @arg FLASH_BOOT_FROM_BANK1: At startup, if boot pins are set in boot from user Flash
  *        position and this parameter is selected the device will boot from Bank1(Default).
  *     @arg FLASH_BOOT_FROM_BANK2: At startup, if boot pins are set in boot from user Flash
  *        position and this parameter is selected the device will boot from Bank2 or Bank1,
  *        depending on the activation of the bank. The active banks are checked in
  *        the following order: Bank2, followed by Bank1.
  *        The active bank is recognized by the value programmed at the base address
  *        of the respective bank (corresponding to the initial stack pointer value
  *        in the interrupt vector table).
  * @retval FLASH Status: The returned value can be: FLASH_PGRM_FLR,
  *         FLASH_WRPRT_FLR, FLASH_PRC_DONE or FLASH_TIMEOUT.
  */
FLASH_Status FLASH_BootOptConfig(uint16_t FLASH_BOOT)
{
  FLASH_Status status = FLASH_PRC_DONE;
  assert_param(IS_FLASH_BOOT_CFG(FLASH_BOOT));
  /* Authorize the small information block programming */
  FLASH->OPTKEYR = FLASH_KEY1;
  FLASH->OPTKEYR = FLASH_KEY2;

