RT-Thread/rt-thread/bsp/at32/Libraries/AT32_Std_Driver/AT32F4xx_StdPeriph_Driver/src/at32f4xx_flash.c
  /* Wait for last process to be completed */
  status = FLASH_WaitForProcess(PRGM_TIMEOUT);

  if(status == FLASH_PRC_DONE)
  {
    /* Enable the Option Bytes Programming process */
    FLASH->CTRL |= CTRL_UOBPRGM_Set;

    if(FLASH_BOOT == FLASH_BOOT_FROM_BANK1)
    {
      UOPTB->USR |= UOB_USR_BTOPT;
    }
    else
    {
      UOPTB->USR &= (uint16_t)(~(uint16_t)(UOB_USR_BTOPT));
    }

    /* Wait for last process to be completed */
    status = FLASH_WaitForProcess(PRGM_TIMEOUT);

    if(status != FLASH_TIMEOUT)
    {
      /* if the program process is completed, disable the UOBPRGM Bit */
      FLASH->CTRL &= CTRL_UOBPRGM_Rst;
    }
  }

  /* Return the Option Byte program Status */
  return status;
}
#endif

/**
  * @brief  Returns the FLASH User Option Bytes values.
  * @note   This function can be used for all at32f4xx devices.
  * @param  None
  * @retval The FLASH User Option Bytes values:IWDG_SW(Bit0), RST_STOP(Bit1)
  *         and RST_STDBY(Bit2).
  */
uint32_t FLASH_GetUserOptionByte(void)
{
  /* Return the User Option Byte */
  return (uint32_t)(FLASH->UOB >> 2);
}

/**
  * @brief  Returns the FLASH Write Protection Option Bytes Register value.
  * @note   This function can be used for all at32f4xx devices.
  * @param  None
  * @retval The FLASH Write Protection  Option Bytes Register value
  */
uint32_t FLASH_GetWriteProtectStatus(void)
{
  /* Return the Flash write protection Register value */
  return (uint32_t)(FLASH->WRPRT);
}

/**
  * @brief  Checks whether the FLASH Read Out Protection Status is set or not.
  * @note   This function can be used for all at32f4xx devices.
  * @param  None
  * @retval FLASH ReadOut Protection Status(SET or RESET)
  */
FlagStatus FLASH_GetReadProtectStatus(void)
{
  FlagStatus readoutstatus = RESET;

  if ((FLASH->UOB & RDPRT_Mask) != (uint32_t)RESET)
  {
    readoutstatus = SET;
  }
  else
  {
    readoutstatus = RESET;
  }

  return readoutstatus;
}

/**
  * @brief  Enables or disables the specified FLASH interrupts.
  * @note   This function can be used for all at32f4xx devices.
  *         - For AT32F4xx XL-Density devices, enables or disables the specified FLASH interrupts
              for Bank1 and Bank2.
  *         - For other devices it enables or disables the specified FLASH interrupts for Bank1.
  * @param  FLASH_INT: specifies the FLASH interrupt sources to be enabled or disabled.
  *   This parameter can be any combination of the following values:
  *     @arg FLASH_INT_FLR: FLASH Error Interrupt
  *     @arg FLASH_INT_PRCDN: FLASH end of process Interrupt
  * @param  NewState: new state of the specified Flash interrupts.
  *   This parameter can be: ENABLE or DISABLE.
  * @retval None
  */
void FLASH_INTConfig(uint32_t FLASH_INT, FunctionalState NewState)
{
#if defined(AT32F403Cx_XL) || defined(AT32F403Rx_XL) || defined(AT32F403Vx_XL) || defined(AT32F403Zx_XL) || \
    defined(AT32F403ACGU7) || defined(AT32F403ACGT7) || defined(AT32F403ARGT7) || defined(AT32F403AVGT7) || \
    defined(AT32F407RGT7)  || defined(AT32F407VGT7)
  /* Check the parameters */
  assert_param(IS_FLASH_INT(FLASH_INT));
  assert_param(IS_FUNCTIONAL_STATE(NewState));

  if((FLASH_INT & FLASH_INT_BANK2) != 0x0)
  {
    if(NewState != DISABLE)
    {
      /* Enable the interrupt sources */
      FLASH->CTRL2 |= (FLASH_INT & FLASH_INT_BANK2_MASK);
    }
    else
    {
      /* Disable the interrupt sources */
      FLASH->CTRL2 &= ~(uint32_t)(FLASH_INT & FLASH_INT_BANK2_MASK);
    }
  }
  else if((FLASH_INT & FLASH_INT_BANK3) != 0x0)
  {
    if(NewState != DISABLE)
    {
      /* Enable the interrupt sources */
      FLASH->CTRL3 |= (FLASH_INT & FLASH_INT_BANK3_MASK);
    }
    else
    {
      /* Disable the interrupt sources */
      FLASH->CTRL3 &= ~(uint32_t)(FLASH_INT & FLASH_INT_BANK3_MASK);
    }
  }
  else
  {
    if(NewState != DISABLE)
    {
      /* Enable the interrupt sources */
      FLASH->CTRL |= FLASH_INT;
    }
    else
    {
      /* Disable the interrupt sources */
      FLASH->CTRL &= ~(uint32_t)FLASH_INT;
    }
  }

#else
  /* Check the parameters */
  assert_param(IS_FLASH_INT(FLASH_INT));
  assert_param(IS_FUNCTIONAL_STATE(NewState));

#if !defined (AT32F415xx)
  if((FLASH_INT & FLASH_INT_BANK3) != 0x0)
  {
    if(NewState != DISABLE)
    {
      /* Enable the interrupt sources */
      FLASH->CTRL3 |= (FLASH_INT & FLASH_INT_BANK3_MASK);
    }
    else
    {
      /* Disable the interrupt sources */
      FLASH->CTRL3 &= ~(uint32_t)(FLASH_INT & FLASH_INT_BANK3_MASK);
    }
  }
  else
  {
    if(NewState != DISABLE)
    {
      /* Enable the interrupt sources */
      FLASH->CTRL |= FLASH_INT;
    }
    else
    {
      /* Disable the interrupt sources */
      FLASH->CTRL &= ~(uint32_t)FLASH_INT;
    }
  }
#else
  if(NewState != DISABLE)
  {
    /* Enable the interrupt sources */
    FLASH->CTRL |= FLASH_INT;
  }
  else
  {
      /* Disable the interrupt sources */
      FLASH->CTRL &= ~(uint32_t)FLASH_INT;
  }
#endif

#endif
}

/**
  * @brief  Checks whether the specified FLASH flag is set or not.
  * @note   This function can be used for all at32f4xx devices.
  *         - For AT32F4xx XL-Density devices, this function checks whether the specified
  *           Bank1 or Bank2 flag is set or not.
  *         - For other devices, it checks whether the specified Bank1 flag is
  *           set or not.
  * @param  FLASH_FLAG: specifies the FLASH flag to check.
  *   This parameter can be one of the following values:
  *     @arg FLASH_FLAG_BSY: FLASH Busy flag
  *     @arg FLASH_FLAG_PRGMFLR: FLASH Program error flag
  *     @arg FLASH_FLAG_WRPRTFLR: FLASH Write protected error flag
  *     @arg FLASH_FLAG_PRCDN: FLASH End of Operation flag
  *     @arg FLASH_FLAG_UOBFLR:  FLASH Option Byte error flag
  * @retval The new state of FLASH_FLAG (SET or RESET).
  */
FlagStatus FLASH_GetFlagStatus(uint32_t FLASH_FLAG)
{
  FlagStatus bitstatus = RESET;

#if defined(AT32F403Cx_XL) || defined(AT32F403Rx_XL) || defined(AT32F403Vx_XL) || defined(AT32F403Zx_XL) || \
    defined(AT32F403ACGU7) || defined(AT32F403ACGT7) || defined(AT32F403ARGT7) || defined(AT32F403AVGT7) || \
    defined(AT32F407RGT7)  || defined(AT32F407VGT7)
  /* Check the parameters */
  assert_param(IS_FLASH_GET_FLAG(FLASH_FLAG)) ;

  if(FLASH_FLAG == FLASH_FLAG_UOBFLR)
  {
    if((FLASH->UOB & FLASH_FLAG_UOBFLR) != (uint32_t)RESET)
    {
      bitstatus = SET;
    }
    else
    {
      bitstatus = RESET;
    }
  }
  else
  {
    if((FLASH_FLAG & FLASH_FLAG_BANK3) != 0x0)
    {
      if((FLASH->STS3 & FLASH_FLAG) != (uint32_t)RESET)
      {
        bitstatus = SET;
      }
      else
      {
        bitstatus = RESET;
      }
    }
    else if((FLASH_FLAG & FLASH_FLAG_BANK2) != 0x0)
    {
      if((FLASH->STS2 & FLASH_FLAG) != (uint32_t)RESET)
      {
        bitstatus = SET;
      }
      else
      {
        bitstatus = RESET;
      }
    }
    else
    {
      if((FLASH->STS & FLASH_FLAG) != (uint32_t)RESET)
      {
        bitstatus = SET;
      }
      else
      {
        bitstatus = RESET;
      }
    }
  }

#else
  /* Check the parameters */
  assert_param(IS_FLASH_GET_FLAG(FLASH_FLAG)) ;

  if(FLASH_FLAG == FLASH_FLAG_UOBFLR)
  {
    if((FLASH->UOB & FLASH_FLAG_UOBFLR) != (uint32_t)RESET)
    {
      bitstatus = SET;
    }
    else
    {
      bitstatus = RESET;
    }
  }
  else
  {
#if !defined (AT32F415xx)
    if((FLASH_FLAG & FLASH_FLAG_BANK3) != 0x0)
    {
      if((FLASH->STS3 & FLASH_FLAG) != (uint32_t)RESET)
      {
        bitstatus = SET;
      }
      else
      {
        bitstatus = RESET;
      }
    }
    else
    {
      if((FLASH->STS & FLASH_FLAG) != (uint32_t)RESET)
      {
        bitstatus = SET;
      }
      else
      {
        bitstatus = RESET;
      }
    }
#else
   if((FLASH->STS & FLASH_FLAG) != (uint32_t)RESET)
   {
     bitstatus = SET;
   }
   else
   {
     bitstatus = RESET;
   }
#endif
  }

#endif

  /* Return the new state of FLASH_FLAG (SET or RESET) */
  return bitstatus;
}

/**
  * @brief  Clears the FLASH's pending flags.
  * @note   This function can be used for all at32f4xx devices.
  *         - For AT32F4xx XL-Density devices, this function clears Bank1 or Bank2 pending flags
  *         - For other devices, it clears Bank1 pending flags.
  * @param  FLASH_FLAG: specifies the FLASH flags to clear.
  *   This parameter can be any combination of the following values:
  *     @arg FLASH_FLAG_PRGMFLR: FLASH Program error flag
  *     @arg FLASH_FLAG_WRPRTFLR: FLASH Write protected error flag
  *     @arg FLASH_FLAG_PRCDN: FLASH End of Operation flag
  * @retval None
  */
void FLASH_ClearFlag(uint32_t FLASH_FLAG)
{
#if defined(AT32F403Cx_XL) || defined(AT32F403Rx_XL) || defined(AT32F403Vx_XL) || defined(AT32F403Zx_XL) || \
    defined(AT32F403ACGU7) || defined(AT32F403ACGT7) || defined(AT32F403ARGT7) || defined(AT32F403AVGT7) || \
    defined(AT32F407RGT7)  || defined(AT32F407VGT7)
  /* Check the parameters */
  assert_param(IS_FLASH_CLEAR_FLAG(FLASH_FLAG)) ;

