RT-Thread/rt-thread/bsp/at32/Libraries/AT32_Std_Driver/AT32F4xx_StdPeriph_Driver/src/at32f4xx_flash.c
  if((FLASH_FLAG & FLASH_FLAG_BANK3) != 0x0)
  {
    /* Clear the flags */
    FLASH->STS3 = FLASH_FLAG;
  }
  else if ((FLASH_FLAG  & FLASH_FLAG_BANK2) != 0x0)
  {
    /* Clear the flags */
    FLASH->STS2 = FLASH_FLAG;
  }
  else
  {
    /* Clear the flags */
    FLASH->STS = FLASH_FLAG;
  }

#else
  /* Check the parameters */
  assert_param(IS_FLASH_CLEAR_FLAG(FLASH_FLAG)) ;

#if !defined (AT32F415xx)
  if((FLASH_FLAG & FLASH_FLAG_BANK3) != 0x0)
  {
    /* Clear the flags */
    FLASH->STS3 = FLASH_FLAG;
  }
  else
  {
    /* Clear the flags */
    FLASH->STS = FLASH_FLAG;
  }
#else
  /* Clear the flags */
  FLASH->STS = FLASH_FLAG;
#endif

#endif
}

/**
  * @brief  Returns the FLASH Status.
  * @note   This function can be used for all at32f4xx devices, it is equivalent
  *         to FLASH_GetBank1Status function.
  * @param  None
  * @retval FLASH Status: The returned value can be: FLASH_BSY, FLASH_PGRM_FLR,
  *         FLASH_WRPRT_FLR or FLASH_PRC_DONE
  */
FLASH_Status FLASH_GetStatus(void)
{
  FLASH_Status flashstatus = FLASH_PRC_DONE;

  if((FLASH->STS & FLASH_FLAG_BSY) == FLASH_FLAG_BSY)
  {
    flashstatus = FLASH_BSY;
  }
  else if((FLASH->STS & FLASH_FLAG_PRGMFLR) != 0)
  {
    flashstatus = FLASH_PGRM_FLR;
  }
  else if((FLASH->STS & FLASH_FLAG_WRPRTFLR) != 0 )
  {
    flashstatus = FLASH_WRPRT_FLR;
  }
  else
  {
    flashstatus = FLASH_PRC_DONE;
  }

  /* Return the Flash Status */
  return flashstatus;
}

/**
  * @brief  Returns the FLASH Bank1 Status.
  * @note   This function can be used for all at32f4xx devices, it is equivalent
  *         to FLASH_GetStatus function.
  * @param  None
  * @retval FLASH Status: The returned value can be: FLASH_BSY, FLASH_PGRM_FLR,
  *         FLASH_WRPRT_FLR or FLASH_PRC_DONE
  */
FLASH_Status FLASH_GetBank1Status(void)
{
  FLASH_Status flashstatus = FLASH_PRC_DONE;

  if((FLASH->STS & FLASH_FLAG_BNK1_BSY) == FLASH_FLAG_BSY)
  {
    flashstatus = FLASH_BSY;
  }
  else if((FLASH->STS & FLASH_FLAG_BNK1_PRGMFLR) != 0)
  {
    flashstatus = FLASH_PGRM_FLR;
  }
  else if((FLASH->STS & FLASH_FLAG_BNK1_WRPRTFLR) != 0 )
  {
    flashstatus = FLASH_WRPRT_FLR;
  }
  else
  {
    flashstatus = FLASH_PRC_DONE;
  }

  /* Return the Flash Status */
  return flashstatus;
}

#if defined(AT32F403Cx_XL) || defined(AT32F403Rx_XL) || defined(AT32F403Vx_XL) || defined(AT32F403Zx_XL) || \
    defined(AT32F403ACGU7) || defined(AT32F403ACGT7) || defined(AT32F403ARGT7) || defined(AT32F403AVGT7) || \
    defined(AT32F407RGT7)  || defined(AT32F407VGT7)
/**
  * @brief  Returns the FLASH Bank2 Status.
  * @note   This function can be used for at32f4xx XL-Density devices.
  * @param  None
  * @retval FLASH Status: The returned value can be: FLASH_BSY, FLASH_PGRM_FLR,
  *        FLASH_WRPRT_FLR or FLASH_PRC_DONE
  */
FLASH_Status FLASH_GetBank2Status(void)
{
  FLASH_Status flashstatus = FLASH_PRC_DONE;

  if((FLASH->STS2 & (FLASH_FLAG_BNK2_BSY & FLASH_INT_BANK2_MASK)) == (FLASH_FLAG_BNK2_BSY & FLASH_INT_BANK2_MASK))
  {
    flashstatus = FLASH_BSY;
  }
  else if((FLASH->STS2 & (FLASH_FLAG_BNK2_PRGMFLR & FLASH_INT_BANK2_MASK)) != 0)
  {
    flashstatus = FLASH_PGRM_FLR;
  }
  else if((FLASH->STS2 & (FLASH_FLAG_BNK2_WRPRTFLR & ~FLASH_INT_BANK2)) != 0 )
  {
    flashstatus = FLASH_WRPRT_FLR;
  }
  else
  {
    flashstatus = FLASH_PRC_DONE;
  }

  /* Return the Flash Status */
  return flashstatus;
}
#endif

#if !defined (AT32F415xx)
/**
  * @brief  Returns the FLASH Bank3 Status.
  * @note   This function can not be used for AT32F415 devices, it is equivalent
  *         to FLASH_GetStatus function.
  * @param  None
  * @retval FLASH Status: The returned value can be: FLASH_BSY, FLASH_PGRM_FLR,
  *         FLASH_WRPRT_FLR or FLASH_PRC_DONE
  */
FLASH_Status FLASH_GetBank3Status(void)
{
  FLASH_Status flashstatus = FLASH_PRC_DONE;


  if((FLASH->STS3 & (FLASH_FLAG_BNK3_BSY & FLASH_INT_BANK3_MASK)) == (FLASH_FLAG_BNK3_BSY & FLASH_INT_BANK3_MASK))
  {
    flashstatus = FLASH_BSY;
  }
  else if((FLASH->STS3 & (FLASH_FLAG_BNK3_PRGMFLR & FLASH_INT_BANK3_MASK)) != 0)
  {
    flashstatus = FLASH_PGRM_FLR;
  }
  else if((FLASH->STS3 & (FLASH_FLAG_BNK3_WRPRTFLR & FLASH_INT_BANK3_MASK)) != 0 )
  {
    flashstatus = FLASH_WRPRT_FLR;
  }
  else
  {
    flashstatus = FLASH_PRC_DONE;
  }

  /* Return the Flash Status */
  return flashstatus;
}
#endif

/**
  * @brief  Waits for a Flash process to complete or a TIMEOUT to occur.
  * @note   This function can be used for all at32f4xx devices,
  *         it is equivalent to FLASH_WaitForBank1Process.
  *         - For AT32F4xx XL-Density devices this function waits for a Bank1 Flash process
  *           to complete or a TIMEOUT to occur.
  *         - For all other devices it waits for a Flash process to complete
  *           or a TIMEOUT to occur.
  * @param  Timeout: FLASH programming Timeout
  * @retval FLASH Status: The returned value can be: FLASH_PGRM_FLR,
  *         FLASH_WRPRT_FLR, FLASH_PRC_DONE or FLASH_TIMEOUT.
  */
FLASH_Status FLASH_WaitForProcess(uint32_t Timeout)
{
  FLASH_Status status = FLASH_PRC_DONE;

  /* Check for the Flash Status */
  status = FLASH_GetBank1Status();

  /* Wait for a Flash process to complete or a TIMEOUT to occur */
  while((status == FLASH_BSY) && (Timeout != 0x00))
  {
    status = FLASH_GetBank1Status();
    Timeout--;
  }

  if(Timeout == 0x00 )
  {
    status = FLASH_TIMEOUT;
  }

  /* Return the process status */
  return status;
}

/**
  * @brief  Waits for a Flash process on Bank1 to complete or a TIMEOUT to occur.
  * @note   This function can be used for all at32f4xx devices,
  *         it is equivalent to FLASH_WaitForProcess.
  * @param  Timeout: FLASH programming Timeout
  * @retval FLASH Status: The returned value can be: FLASH_PGRM_FLR,
  *         FLASH_WRPRT_FLR, FLASH_PRC_DONE or FLASH_TIMEOUT.
  */
FLASH_Status FLASH_WaitForBank1Process(uint32_t Timeout)
{
  FLASH_Status status = FLASH_PRC_DONE;

  /* Check for the Flash Status */
  status = FLASH_GetBank1Status();

  /* Wait for a Flash process to complete or a TIMEOUT to occur */
  while((status == FLASH_FLAG_BNK1_BSY) && (Timeout != 0x00))
  {
    status = FLASH_GetBank1Status();
    Timeout--;
  }

