RT-Thread/rt-thread/bsp/at32/Libraries/AT32_Std_Driver/AT32F4xx_StdPeriph_Driver/src/at32f4xx_flash.c
  if(Timeout == 0x00 )
  {
    status = FLASH_TIMEOUT;
  }

  /* Return the process status */
  return status;
}

#if defined(AT32F403Cx_XL) || defined(AT32F403Rx_XL) || defined(AT32F403Vx_XL) || defined(AT32F403Zx_XL) || \
    defined(AT32F403ACGU7) || defined(AT32F403ACGT7) || defined(AT32F403ARGT7) || defined(AT32F403AVGT7) || \
    defined(AT32F407RGT7)  || defined(AT32F407VGT7)
/**
  * @brief  Waits for a Flash process on Bank2 to complete or a TIMEOUT to occur.
  * @note   This function can be used only for at32f4xx XL-Density devices.
  * @param  Timeout: FLASH programming Timeout
  * @retval FLASH Status: The returned value can be: FLASH_PGRM_FLR,
  *         FLASH_WRPRT_FLR, FLASH_PRC_DONE or FLASH_TIMEOUT.
  */
FLASH_Status FLASH_WaitForBank2Process(uint32_t Timeout)
{
  FLASH_Status status = FLASH_PRC_DONE;

  /* Check for the Flash Status */
  status = FLASH_GetBank2Status();

  /* Wait for a Flash process to complete or a TIMEOUT to occur */
  while((status == (FLASH_FLAG_BNK2_BSY & FLASH_INT_BANK2_MASK)) && (Timeout != 0x00))
  {
    status = FLASH_GetBank2Status();
    Timeout--;
  }

  if(Timeout == 0x00 )
  {
    status = FLASH_TIMEOUT;
  }

  /* Return the process status */
  return status;
}
#endif

#if !defined (AT32F415xx)
/**
  * @brief  Waits for a Flash process on Bank3 to complete or a TIMEOUT to occur.
  * @note   This function can not be used for AT32F415 devices.
  * @param  Timeout: FLASH programming Timeout
  * @retval FLASH Status: The returned value can be: FLASH_PGRM_FLR,
  *         FLASH_WRPRT_FLR, FLASH_PRC_DONE or FLASH_TIMEOUT.
  */
FLASH_Status FLASH_WaitForBank3Process(uint32_t Timeout)
{
  FLASH_Status status = FLASH_PRC_DONE;

  /* Check for the Flash Status */
  status = FLASH_GetBank3Status();

  /* Wait for a Flash process to complete or a TIMEOUT to occur */
  while((status == (FLASH_FLAG_BNK3_BSY & FLASH_INT_BANK3_MASK)) && (Timeout != 0x00))
  {
    status = FLASH_GetBank3Status();
    Timeout--;
  }

  if(Timeout == 0x00 )
  {
    status = FLASH_TIMEOUT;
  }

  /* Return the process status */
  return status;
}
#endif

#if !defined (AT32F415xx)
/**
  * @brief To set the end address of encrypted data in BANK3.
  *        When the address is larger than this value, the writing data will be
  *        directly written to BANK3 without encryption.
  * @note   This function can not be used for AT32F415 devices.
  * @param EndAddress: The end address of encrypted data in BANK3
  * @retval: None
  */
void FLASH_Bank3EncEndAddrConfig(uint32_t EndAddress)
{
  assert_param(IS_IN_FLASH_BANK3_RANGE(EndAddress));
  if((UOPTB->BANK3SCRKEY[0]==0xFFFFFFFF) && (UOPTB->BANK3SCRKEY[1]==0xFFFFFFFF) && \
     (UOPTB->BANK3SCRKEY[2]==0xFFFFFFFF) && (UOPTB->BANK3SCRKEY[3]==0xFFFFFFFF))
    return;
  if((UOPTB->BANK3SCRKEY[0]==0xFF00FF00) && (UOPTB->BANK3SCRKEY[1]==0xFF00FF00) && \
     (UOPTB->BANK3SCRKEY[2]==0xFF00FF00) && (UOPTB->BANK3SCRKEY[3]==0xFF00FF00))
    return;
  if((UOPTB->BANK3SCRKEY[0]==0x00FF00FF) && (UOPTB->BANK3SCRKEY[1]==0x00FF00FF) && \
     (UOPTB->BANK3SCRKEY[2]==0x00FF00FF) && (UOPTB->BANK3SCRKEY[3]==0x00FF00FF))
    return;
  FLASH->DA = EndAddress;
}
#endif

/**
  * @brief  Enable SLIB in Main Block
  * @note   This function can be used for all AT32F4xx devices.
  * @param  Psw: SLIB Password
  *         StartPage:SLIB Start Page
  *         DataPage: SLIB data Start Page
  *         EndPage:  SLIB End Page
  *         => SLIB Range = Page#N to Page#C
  * @retval FLASH Status: The returned value can be: FLASH_BSY, FLASH_PGRM_FLR,
  *         FLASH_WRPRT_FLR, FLASH_PRC_DONE or FLASH_TIMEOUT.
  */
FLASH_Status FLASH_SlibMainEnable(uint32_t Psw, uint16_t StartPage, uint16_t DataStartPage, uint16_t EndPage)
{
  uint32_t SlibRange;
  FLASH_Status Status = FLASH_PRC_DONE;

  assert_param(IS_SLIB_DISABLE());
  assert_param((Psw != 0xFFFFFFFF)&&(Psw != 0x00000000));
  assert_param((StartPage >= 1)&&(StartPage <= 127));
  assert_param((DataStartPage >= 1)&&(DataStartPage <= 127));
  assert_param((EndPage >= 1)&&(EndPage <= 127));

  /* Wait for last process to be completed */
  Status = FLASH_WaitForProcess(PRGM_TIMEOUT);
  /*check param limits*/
  if((StartPage>=DataStartPage) || ((DataStartPage>EndPage)&&(DataStartPage!=0x7FF)) || (StartPage>EndPage))
    return Status;

  SlibRange = ((uint32_t)DataStartPage<<11&FLASH_SLIB_DATA_START_PAGE) | ((uint32_t)EndPage<<22&FLASH_SLIB_END_PAGE) | ((uint32_t)StartPage&FLASH_SLIB_START_PAGE);

  if(Status == FLASH_PRC_DONE)
  {
      /* Unlock SLIB CFG register */
      FLASH->SLIB_KEYR = SLIB_UNLOCK_KEY;

      /* Configure SLIB, set PSW and RANGE */
      FLASH->SLIB_SET_PSW = Psw;
      Status = FLASH_WaitForProcess(PRGM_TIMEOUT);

      FLASH->SLIB_SET_RANGE = SlibRange;
      Status = FLASH_WaitForProcess(PRGM_TIMEOUT);
  }
  return Status;
}

/**
  * @brief  Disable SLIB when SLIB enabled
  * @note   This function can be used for all AT32F4xx devices.
  * @param  Psw: SLIB Password
  * @retval SUCCESS or ERROR
  */
uint32_t FLASH_SlibDisable(uint32_t Psw)
{
  FLASH_Status Status = FLASH_PRC_DONE;

  assert_param(!IS_SLIB_DISABLE());

  /* Write Password to disable SLIB */
  FLASH->SLIB_PSW = Psw;
  Status = FLASH_WaitForProcess(ERS_TIMEOUT);

  if(Status == FLASH_PRC_DONE)
  {
    if(FLASH->SLIB_PSW_STS & FLASH_SLIB_PSWSTS_PSW_OK)
      return SUCCESS;
    else
      return ERROR;
  }

  return ERROR;
}

#if !defined (AT32F415xx)
/**
 * @brief  Get the value of current remaining SLIB CFG count (range: 256~0)
 * @note   This function can not be used for AT32F415 devices.
 * @param  None
 * @retval uint32_t
 */
uint32_t FLASH_GetSlibCurCnt(void)
{
  return ((FLASH->SLIB_PSW_STS & FLASH_SLIB_CNT) >> 16);
}
#endif

/**
  * @brief  Get the SLIB state
  * @note   This function can be used for all AT32F4xx devices.
  * @param  None
  * @retval ENABLE or DISABLE
  */
uint8_t FLASH_GetSlibState(void)
{
  if(FLASH->SLIB_CDR0&FLASH_SLIB_CDR0_SLIB_EN)
    return ENABLE;
  else
    return DISABLE;
}

/**
 * @brief  Get the start page of SLIB
 * @note   This function can be used for all AT32F4xx devices
 * @param  None
 * @retval uint16_t
 */
uint16_t FLASH_GetSlibStartPage(void)
{
  return (uint16_t)((FLASH->SLIB_CDR1&FLASH_SLIB_SET_START_PAGE)>>0);
}

/**
 * @brief  Get the data start page of SLIB
 * @note   This function can be used for all AT32F4xx devices
 * @param  None
 * @retval uint16_t
 */
uint16_t FLASH_GetSlibDataStartPage(void)
{
  return (uint16_t)((FLASH->SLIB_CDR1&FLASH_SLIB_SET_DATA_START_PAGE)>>11);
}

/**
 * @brief  Get the end page of SLIB
 * @note   This function can be used for all AT32F4xx devices
 * @param  None
 * @retval uint16_t
 */
uint16_t FLASH_GetSlibEndPage(void)
{
  return (uint16_t)((FLASH->SLIB_CDR1&FLASH_SLIB_SET_END_PAGE)>>22);
}

