RT-Thread/rt-thread/bsp/at32/Libraries/AT32_Std_Driver/AT32F4xx_StdPeriph_Driver/src/at32f4xx_flash.c
#if defined (AT32F415xx)
/**
  * @brief  Configure System Memory as AP mode
  * @note   This function can be used only for AT32F415 device.
  * @param  None
  * @retval FLASH Status: The returned value can be: FLASH_BSY, FLASH_PGRM_FLR,
  *         FLASH_WRPRT_FLR, FLASH_PRC_DONE or FLASH_TIMEOUT.
  */
FLASH_Status FLASH_SYS_AP(void)
{
  volatile FLASH_Status tStatus = FLASH_PRC_DONE;

  assert_param(IS_SLIB_DISABLE());
  assert_param(IS_RDP_DISABLE());

  if((FLASH->SLIB_CDR0 & FLASH_SLIB_CDR0_BOOT_DIS) == 0)
  {
    FLASH->SLIB_KEYR = SLIB_UNLOCK_KEY;
    while((FLASH->SLIB_PSW_STS & FLASH_SLIB_UNLOCK) == 0);
    FLASH->SYS_BOOT_DIS_SET = 0;
    tStatus = FLASH_WaitForProcess(PRGM_TIMEOUT);
  }
  return tStatus;
}
#endif /* AT32F415xx */

#if defined (AT32F415xx)
/**
  * @brief  Enable SLIB in System Memory
  * @note   This function can be used only for AT32F415 device.
  * @param  Psw: SLIB Password
  *         data_start_page: SLIB data Start Page
  * @retval FLASH Status: The returned value can be: FLASH_BSY, FLASH_PGRM_FLR,
  *         FLASH_WRPRT_FLR, FLASH_PRC_DONE or FLASH_TIMEOUT.
  */
FLASH_Status FLASH_SlibSysEnable(uint32_t Psw,uint8_t data_start_page)
{
  volatile FLASH_Status tStatus = FLASH_PRC_DONE;
  assert_param(IS_SLIB_DISABLE());

  /* Wait for last process to be completed */
  tStatus = FLASH_WaitForProcess(PRGM_TIMEOUT);
  /* Unlock SLIB CFG register */
  FLASH->SLIB_KEYR = SLIB_UNLOCK_KEY;
  while((FLASH->SLIB_PSW_STS & FLASH_SLIB_UNLOCK) == 0);

  /* make sure System Memory as AP mode */
  if(FLASH->SLIB_CDR0 & FLASH_SLIB_CDR0_BOOT_DIS)
  {
    FLASH->SYS_SLIB_SET = (data_start_page<<16)+0x5AA5;
    tStatus = FLASH_WaitForProcess(PRGM_TIMEOUT);
    FLASH->SLIB_SET_PSW = Psw;
    tStatus = FLASH_WaitForProcess(PRGM_TIMEOUT);
  }

  return tStatus;
}
#endif /* AT32F415xx */

#if defined (AT32F415xx)
/**
  * @brief  Check whether the option byte protection is set or not.
  * @note   This function can be used only for AT32F415 device.
  * @param  None
  * @retval Flash option byte protection status(SET or RESET)
  */
FlagStatus FLASH_GetOptionByteProtectStatus(void)
{
  FlagStatus status = RESET;

  if ((FLASH->UOB & FLASH_UOB_RDPRTEN) != (uint32_t)RESET)
  {
    if ((FLASH->UOB & FLASH_UOB_OPTION_BYTE_PRT_EN) != (uint32_t)RESET)
    {
      status = SET;
    }
  }

  return status;
}
#endif /* AT32F415xx */

#if defined (AT32F415xx)
/**
  * @brief  Configure the option byte protection.
  * @note   If the user has already programmed the other option bytes before calling
  *         this function, he must re-program them since this function erases all option bytes.
  * @note   This function can be used only for AT32F415 device.
  * @param  None
  * @retval FLASH Status: The returned value can be: FLASH_BSY, FLASH_PGRM_FLR,
  *         FLASH_WRPRT_FLR, FLASH_PRC_DONE or FLASH_TIMEOUT.
  */
FLASH_Status FLASH_RDPandOptionByteProtectEnable(void)
{
  FLASH_Status status = FLASH_PRC_DONE;
  /* Check the parameters */

  status = FLASH_WaitForProcess(ERS_TIMEOUT);

  if(status == FLASH_PRC_DONE)
  {
    /* Unlock OTP2 */
    FLASH->OPTKEYR = FLASH_KEY1;
    FLASH->OPTKEYR = FLASH_KEY2;

    /* Erase OTP2 */
    FLASH->CTRL |= CTRL_UOBERS_Set;
    FLASH->CTRL |= CTRL_STRT_Set;
    status = FLASH_WaitForProcess(ERS_TIMEOUT);

    if(status == FLASH_PRC_DONE)
    {
      FLASH->CTRL &= CTRL_UOBERS_Rst;

      /* Program OTP2 */
      FLASH->CTRL |= CTRL_UOBPRGM_Set;
      UOPTB->RDPRT = OPTION_BYTE_PRT_Key;
      status = FLASH_WaitForProcess(ERS_TIMEOUT);

      if(status != FLASH_TIMEOUT)
      {
        FLASH->CTRL &= CTRL_UOBPRGM_Rst;
      }
    }
    else
    {
      if(status != FLASH_TIMEOUT)
      {
        FLASH->CTRL &= CTRL_UOBERS_Rst;
      }
    }

    /* Disable OTP write enable bit */
    FLASH->CTRL &= CTRL_UOBWE_Rst;
  }
  return status;
}
#endif /* AT32F415xx */

#if defined (AT32F415xx)
/**
  * @brief  Disable the option byte protection.
  * @note   This function can be used only for AT32F415 device.
  * @param  None
  * @retval None
  */
void FLASH_OptionByteProtectDisable(void)
{
  volatile FLASH_Status tStatus = FLASH_PRC_DONE;

  if (FLASH_GetOptionByteProtectStatus() != SET)
  {
    /* option byte protection is not set */
    return;
  }
  FLASH->CTRL |= FLASH_CTRL_OPTION_BYTE_PRT_DIS_TRIG;
  tStatus = FLASH_WaitForProcess(ERS_TIMEOUT);
}
#endif /* AT32F415xx */

/**
  * @}
  */

/**
  * @}
  */

/**
  * @}
  */

